# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.17-s066_1 on Thu Nov 06 15:07:31 EST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design mult_unsigned

create_clock -name "clk" -period 6.6667 -waveform {0.0 3.33335} [get_ports clk]
set_load -pin_load 4.0 [get_ports {RES[39]}]
set_load -pin_load 4.0 [get_ports {RES[38]}]
set_load -pin_load 4.0 [get_ports {RES[37]}]
set_load -pin_load 4.0 [get_ports {RES[36]}]
set_load -pin_load 4.0 [get_ports {RES[35]}]
set_load -pin_load 4.0 [get_ports {RES[34]}]
set_load -pin_load 4.0 [get_ports {RES[33]}]
set_load -pin_load 4.0 [get_ports {RES[32]}]
set_load -pin_load 4.0 [get_ports {RES[31]}]
set_load -pin_load 4.0 [get_ports {RES[30]}]
set_load -pin_load 4.0 [get_ports {RES[29]}]
set_load -pin_load 4.0 [get_ports {RES[28]}]
set_load -pin_load 4.0 [get_ports {RES[27]}]
set_load -pin_load 4.0 [get_ports {RES[26]}]
set_load -pin_load 4.0 [get_ports {RES[25]}]
set_load -pin_load 4.0 [get_ports {RES[24]}]
set_load -pin_load 4.0 [get_ports {RES[23]}]
set_load -pin_load 4.0 [get_ports {RES[22]}]
set_load -pin_load 4.0 [get_ports {RES[21]}]
set_load -pin_load 4.0 [get_ports {RES[20]}]
set_load -pin_load 4.0 [get_ports {RES[19]}]
set_load -pin_load 4.0 [get_ports {RES[18]}]
set_load -pin_load 4.0 [get_ports {RES[17]}]
set_load -pin_load 4.0 [get_ports {RES[16]}]
set_load -pin_load 4.0 [get_ports {RES[15]}]
set_load -pin_load 4.0 [get_ports {RES[14]}]
set_load -pin_load 4.0 [get_ports {RES[13]}]
set_load -pin_load 4.0 [get_ports {RES[12]}]
set_load -pin_load 4.0 [get_ports {RES[11]}]
set_load -pin_load 4.0 [get_ports {RES[10]}]
set_load -pin_load 4.0 [get_ports {RES[9]}]
set_load -pin_load 4.0 [get_ports {RES[8]}]
set_load -pin_load 4.0 [get_ports {RES[7]}]
set_load -pin_load 4.0 [get_ports {RES[6]}]
set_load -pin_load 4.0 [get_ports {RES[5]}]
set_load -pin_load 4.0 [get_ports {RES[4]}]
set_load -pin_load 4.0 [get_ports {RES[3]}]
set_load -pin_load 4.0 [get_ports {RES[2]}]
set_load -pin_load 4.0 [get_ports {RES[1]}]
set_load -pin_load 4.0 [get_ports {RES[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {B[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {A[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {RES[39]}]
set_max_fanout 5.000 [get_ports clk]
set_max_fanout 5.000 [get_ports {A[15]}]
set_max_fanout 5.000 [get_ports {A[14]}]
set_max_fanout 5.000 [get_ports {A[13]}]
set_max_fanout 5.000 [get_ports {A[12]}]
set_max_fanout 5.000 [get_ports {A[11]}]
set_max_fanout 5.000 [get_ports {A[10]}]
set_max_fanout 5.000 [get_ports {A[9]}]
set_max_fanout 5.000 [get_ports {A[8]}]
set_max_fanout 5.000 [get_ports {A[7]}]
set_max_fanout 5.000 [get_ports {A[6]}]
set_max_fanout 5.000 [get_ports {A[5]}]
set_max_fanout 5.000 [get_ports {A[4]}]
set_max_fanout 5.000 [get_ports {A[3]}]
set_max_fanout 5.000 [get_ports {A[2]}]
set_max_fanout 5.000 [get_ports {A[1]}]
set_max_fanout 5.000 [get_ports {A[0]}]
set_max_fanout 5.000 [get_ports {B[23]}]
set_max_fanout 5.000 [get_ports {B[22]}]
set_max_fanout 5.000 [get_ports {B[21]}]
set_max_fanout 5.000 [get_ports {B[20]}]
set_max_fanout 5.000 [get_ports {B[19]}]
set_max_fanout 5.000 [get_ports {B[18]}]
set_max_fanout 5.000 [get_ports {B[17]}]
set_max_fanout 5.000 [get_ports {B[16]}]
set_max_fanout 5.000 [get_ports {B[15]}]
set_max_fanout 5.000 [get_ports {B[14]}]
set_max_fanout 5.000 [get_ports {B[13]}]
set_max_fanout 5.000 [get_ports {B[12]}]
set_max_fanout 5.000 [get_ports {B[11]}]
set_max_fanout 5.000 [get_ports {B[10]}]
set_max_fanout 5.000 [get_ports {B[9]}]
set_max_fanout 5.000 [get_ports {B[8]}]
set_max_fanout 5.000 [get_ports {B[7]}]
set_max_fanout 5.000 [get_ports {B[6]}]
set_max_fanout 5.000 [get_ports {B[5]}]
set_max_fanout 5.000 [get_ports {B[4]}]
set_max_fanout 5.000 [get_ports {B[3]}]
set_max_fanout 5.000 [get_ports {B[2]}]
set_max_fanout 5.000 [get_ports {B[1]}]
set_max_fanout 5.000 [get_ports {B[0]}]
set_drive 2.0 [get_ports clk]
set_drive 2.0 [get_ports {A[15]}]
set_drive 2.0 [get_ports {A[14]}]
set_drive 2.0 [get_ports {A[13]}]
set_drive 2.0 [get_ports {A[12]}]
set_drive 2.0 [get_ports {A[11]}]
set_drive 2.0 [get_ports {A[10]}]
set_drive 2.0 [get_ports {A[9]}]
set_drive 2.0 [get_ports {A[8]}]
set_drive 2.0 [get_ports {A[7]}]
set_drive 2.0 [get_ports {A[6]}]
set_drive 2.0 [get_ports {A[5]}]
set_drive 2.0 [get_ports {A[4]}]
set_drive 2.0 [get_ports {A[3]}]
set_drive 2.0 [get_ports {A[2]}]
set_drive 2.0 [get_ports {A[1]}]
set_drive 2.0 [get_ports {A[0]}]
set_drive 2.0 [get_ports {B[23]}]
set_drive 2.0 [get_ports {B[22]}]
set_drive 2.0 [get_ports {B[21]}]
set_drive 2.0 [get_ports {B[20]}]
set_drive 2.0 [get_ports {B[19]}]
set_drive 2.0 [get_ports {B[18]}]
set_drive 2.0 [get_ports {B[17]}]
set_drive 2.0 [get_ports {B[16]}]
set_drive 2.0 [get_ports {B[15]}]
set_drive 2.0 [get_ports {B[14]}]
set_drive 2.0 [get_ports {B[13]}]
set_drive 2.0 [get_ports {B[12]}]
set_drive 2.0 [get_ports {B[11]}]
set_drive 2.0 [get_ports {B[10]}]
set_drive 2.0 [get_ports {B[9]}]
set_drive 2.0 [get_ports {B[8]}]
set_drive 2.0 [get_ports {B[7]}]
set_drive 2.0 [get_ports {B[6]}]
set_drive 2.0 [get_ports {B[5]}]
set_drive 2.0 [get_ports {B[4]}]
set_drive 2.0 [get_ports {B[3]}]
set_drive 2.0 [get_ports {B[2]}]
set_drive 2.0 [get_ports {B[1]}]
set_drive 2.0 [get_ports {B[0]}]
set_wire_load_mode "enclosed"
